src/CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыйМинимальныйОстатокТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланкаКоличестваДляЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтслеживатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьУказаниеБезСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияНаДругихЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНаДругихЯзыках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектБазыДанных</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Enums/ИгнорироватьРазрешитьЗапретить.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ИгнорироватьРазрешитьЗапретить</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Игнорировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьНоПредупредить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CF/Catalogs/НоменклатурныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>НоменклатурныеГруппы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Производители</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФормулаАвтоНаименованияНоменклатурыДаннойГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулыОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязатьОдноименнуюГруппуНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураЭтойГруппыССерийнымУчетом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Номенклатура/Forms/ФормаЭлементаУпрощенная/Ext/Form/Module.bsl
//sza140119-1612 
//sza130902-0029 : 

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)	
	Объект.Наименование = Текст;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	ВестиУчетПоСкладам 				= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
	СоздаватьГруппыНоменклатурыПоПервомуСловуНаименованияИАвтоматическиОтноситьКНимНоменклатуру = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СоздаватьГруппыНоменклатурыПоПервомуСловуНаименованияИАвтоматическиОтноситьКНимНоменклатуру");
	ИспользоватьСложныйМеханизмЦен 	= ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
	УчетПоСериям = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры");
	дата 		 = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	ПоддержкаДругихЯзыков = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") 
	И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина);
	РегулироватьКоличествоНоменклатурыПоУмолчаниюДляУпаковок = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РегулироватьКоличествоНоменклатурыПоУмолчаниюДляУпаковок");
	
	ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры = Истина; //для алгоритма
	
	элементы.ОбновитьШтрихКодПоФормуле.Видимость = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды") И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом");
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.СерийныйУчет = параметры.СерийныйУчет;
		
		Если НЕ ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа) Тогда
			Объект.НоменклатурнаяГруппа = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаПоУмолчанию");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Производитель) Тогда
			Объект.Производитель = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПроизводительПоУмолчанию");
		КонецЕсли;
		
		Если Объект.ПланкаКоличестваДляЛьготнойЦены = 0 Тогда
			Объект.ПланкаКоличестваДляЛьготнойЦены = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РазмерПланкиКоличестваТовараДляЛьготнойЦены") ;
		КонецЕсли;		
		
		//Элементы.Цены.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.Родитель) 
			и НЕ ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 НоменклатурныеГруппы.Ссылка
			|ИЗ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
			|ГДЕ НоменклатурныеГруппы.СвязатьОдноименнуюГруппуНоменклатуры = Истина
			|	И НоменклатурныеГруппы.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", Объект.Родитель.Наименование);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Объект.НоменклатурнаяГруппа = ВыборкаДетальныеЗаписи.ссылка;
				КонецЦикла;	
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ТоварИлиУслуга.Видимость 		= истина;
		
	Иначе //существующая		
		НоменклатураНеИспользовалась = ОбщийМодульСервер.ПроверитьЧтоНоменклатураНеИспользовалась(Объект.Ссылка);
		
		Если Объект.Предопределенный 
			или объект.НеОтслеживатьОстаток Тогда //Товар на сумму
			
			Элементы.Родитель.Видимость 		= Ложь;
			Элементы.ГруппаНабора.Видимость 	= ложь;
			Элементы.ТоварИлиУслуга.Видимость 	= ложь;
			Элементы.РекомендуемыйМинимальныйОстатокТовара.Видимость = Ложь;
			ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры = Ложь;
			
		ИначеЕсли объект.ЭтоНабор = ИСТИНА 
			и ПараметрыСеанса.ИспользованиеНаборовТоваровПС Тогда
			
			Если НоменклатураНеИспользовалась Тогда
				элементы.Состав.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Состав набора");
			иначе
				элементы.Состав.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Состав набора нельзя изменить после указания в документах. Создавайте новые наборы для иного состава.");
			КонецЕсли;
			
			элементы.ЭтоНабор.ТолькоПросмотр 			= НЕ НоменклатураНеИспользовалась;
			элементы.Состав.ТолькоПросмотр 				= НЕ НоменклатураНеИспользовалась;
			Элементы.ТоварИлиУслуга.Видимость 			= ложь;
			Элементы.РекомендуемыйМинимальныйОстатокТовара.Видимость = Ложь;
			
		иначе			
			Элементы.ТоварИлиУслуга.Видимость 	= ложь;
			Элементы.ГруппаНабора.Видимость 	= НоменклатураНеИспользовалась;
			элементы.ОстатокНеОтслеживается.Видимость	= НЕ НоменклатураНеИспользовалась;
			элементы.НеОтслеживатьОстаток.Видимость		= НоменклатураНеИспользовалась;
			элементы.СериныйУчет.Видимость				= НЕ НоменклатураНеИспользовалась;
			
			Если НЕ НоменклатураНеИспользовалась 
				И Объект.ЗапретитьУказаниеБезСерии Тогда
				
				элементы.СериныйУчет.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обязательно сопровождается серией");
			КонецЕсли;
			Элементы.ГруппаСерийногоУчета.Видимость 	= НоменклатураНеИспользовалась;
			
		КонецЕсли;
		
		Если НЕ НоменклатураНеИспользовалась
			И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("БлокироватьКарточкуНоменклатурыПослеУказанияЕеВдокументах") Тогда
			
			Элементы.Наименование.ТолькоПросмотр 	= Истина;
			Элементы.ВерхСлева.ТолькоПросмотр 		= Истина;
			Элементы.Дополнительно.ТолькоПросмотр 	= Истина;
		КонецЕсли;
		
		Если объект.СерийныйУчет
			и НЕ Найти(объект.Наименование, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Новый серийный товар")) = 0 Тогда
			
			Объект.Наименование = "";
		КонецЕсли;
		
	КонецЕсли;
	
	если ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры тогда
		ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка");
		
		Если ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать 
			или НЕ ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка) Тогда
			
			ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры = Ложь;
		иначе
			ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры");
		КонецЕсли;	                                                                        	
	КонецЕсли;
	
	НоменклатурнаяГруппаПриИзмененииНаСервере();
	
	ИспользоватьПодключаемоеОборудование 		= ПодключаемоеОборудованиеДСервер.ИспользоватьПодключаемоеОборудование();
	УстанавливатьШтрихКодИзКарточкиНоменклатуры = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
	И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("УстанавливатьШтрихКодИзКарточкиНоменклатуры");
	
	Элементы.Цена.Видимость = не ИспользоватьСложныйМеханизмЦен;
	
	Если Объект.SKU = 0 Тогда
		Объект.SKU = ПодключаемоеОборудованиеДСервер.ПолучитьМаксимальныйКодSKU();
	КонецЕсли;	
	
	НаименованиеОсновнойВалюты = Справочники.Валюты.ОсновнаяВалюта.Наименование ;
	элементы.НаименованиеОсновнойВалюты.Видимость = не ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
	
	Элементы.ПроцентСкидки.Видимость = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") 
	и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВключитьВозможностьУказыватьПроцентСкидкиДляНоменклатуры");
	Элементы.КоличествоПоУмолчанию.Видимость = не объект.СерийныйУчет И РегулироватьКоличествоНоменклатурыПоУмолчаниюДляУпаковок;
	
	ВидимостьСоставаНабора();
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") Тогда
		
		элементы.ПересчитатьЦенуНабораПоСуммеЦенВсехЭлементовСостава.Видимость = ложь;
		элементы.ПроцентСкидки.Доступность 	= Ложь;
//		элементы.Цены.ТолькоПросмотр 		= Истина;
//		Элементы.ЦеныДобавитьЦену.Видимость = ложь;
		элементы.ПланкаКоличестваДляЛьготнойЦены.ТолькоПросмотр = истина;
		
	КонецЕсли;
	
	обновитьвидимостьуслуги();
	РодительПриИзмененииНаСервере();	
	элементы.НоменклатурнаяГруппа.ОтметкаНезаполненного = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС")
	И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаОбязательныйРеквизитЛюбойНоменклатуры");		
	
	если ПоддержкаДругихЯзыков 
		и ЗначениеЗаполнено(Объект.Ссылка) тогда
		
		ПредставлениеНаименования = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(объект.Ссылка);
		НаименованиеДляПечати = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(объект.Ссылка, "НаименованиеДляПечати");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ЗначенияНаДругихЯзыках.Язык,
		|	ЗначенияНаДругихЯзыках.НаЯзыке,
		|	ЗначенияНаДругихЯзыках.Поле
		|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
		|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных";
		
		Запрос.УстановитьПараметр("ОбъектБазыДанных", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.Поле = "Наименование" Тогда
					СтрокаЯзыка = НаименованияНаДругихЯзыках.Добавить();
					СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
					СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;
					
				ИначеЕсли ВыборкаДетальныеЗаписи.Поле = "НаименованиеДляПечати" Тогда
					СтрокаЯзыка = НаименованияДляПечатиНаДругихЯзыках.Добавить();
					СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
					СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	иначе
		ПредставлениеНаименования = объект.Наименование;
		НаименованиеДляПечати = Объект.НаименованиеДляПечати;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурнаяГруппаПриИзменении(Элемент)
	НоменклатурнаяГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НоменклатурнаяГруппаПриИзмененииНаСервере()
	
	ОбщийМодульТоварСервер.УстановитьНаименованиеНоменклатурыПоФормуле(Объект);
	Элементы.Родитель.ТолькоПросмотр 		= Ложь;
	Элементы.СерийныйУчет.ТолькоПросмотр 	= Ложь;
	
	НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
	
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		
		Если НоменклатурнаяГруппа.СвязатьОдноименнуюГруппуНоменклатуры Тогда		
			
			Родитель = Справочники.Номенклатура.НайтиПоНаименованию(НоменклатурнаяГруппа.Наименование) ;			
			Если НЕ объект.Родитель = Родитель Тогда
				объект.Родитель = Родитель;				
			КонецЕсли;
			
			Элементы.Родитель.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
		Если НоменклатурнаяГруппа.НоменклатураЭтойГруппыССерийнымУчетом тогда
			
			если не Объект.СерийныйУчет Тогда					
				Объект.СерийныйУчет = Истина;	
			КонецЕсли;
			Элементы.СерийныйУчет.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)
	НоменклатурнаяГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	НоменклатурнаяГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШтрихКодПоФормуле(Команда)
	ОбновитьШтрихКодПоФормулеНаСервере(Истина);
КонецПроцедуры

&НаСервере
Процедура ОбновитьШтрихКодПоФормулеНаСервере(Принудительно)
	
	Если Принудительно 
		или Объект.ОсновнойШтрихКод = "" Тогда
		
		Объект.ОсновнойШтрихКод = ОбщийМодульТоварСервер.УстановитьШтрихКодНоменклатурыПоФормуле(Объект);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, истина);
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При подключении оборудования произошла ошибка:") + " " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

	если не ЗначениеЗаполнено(объект.Ссылка) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;	
	КонецЕсли;
	
	СерийныйУчетПриИзмененииК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ   	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, Истина);
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			
			Этаформа.ТекущийЭлемент = элементы.ОсновнойШтрихКод;
			ОбработатьПолученныйШКНаКлиенте(ТекКод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШКНаклиенте(ТекКод)
	
	Если УстанавливатьШтрихКодИзКарточкиНоменклатуры
		или	Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установить Штрих-Код основным для этой номенклатуры?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		
		Объект.ОсновнойШтрихКод = ТекКод;
	конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоНаборПриИзменении(Элемент)
	ВидимостьСоставаНабора();
КонецПроцедуры

процедура ВидимостьСоставаНабора()
	
	элементы.ГруппаСоставИСуммы.Видимость 						= объект.ЭтоНабор = ИСТИНА ;	
	элементы.РекомендуемыйМинимальныйОстатокТовара.Видимость 	= Не (объект.ЭтоНабор = ИСТИНА ) И ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры;	
	элементы.ПересчитатьЦенуНабораПоСуммеЦенВсехЭлементовСостава.Видимость = не ИспользоватьСложныйМеханизмЦен и объект.ЭтоНабор = ИСТИНА ;	
	элементы.КоличествоНаборовКотороеМожноСобратьНаТекущийМомент.Видимость = ЗначениеЗаполнено(объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуНабораПоСуммеЦенВсехЭлементовСостава(Команда)
	ПересчитатьЦенуНабораПоСуммеЦенВсехЭлементовСоставаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуНабораПоСуммеЦенВсехЭлементовСоставаНаСервере()
	
	объект.Цена = 0;
	для каждого СтрокаСоставаНабора из объект.Состав цикл
		Если ЗначениеЗаполнено(СтрокаСоставаНабора.номенклатура) Тогда
			объект.Цена = объект.Цена + СтрокаСоставаНабора.количество * ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаСоставаНабора.номенклатура, , ОбщийМодульСервисСервер.ПользователяТекущаяДата(), Истина, СтрокаСоставаНабора.количество, , , , Объект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоНаборовКотороеМожноСобратьНаТекущийМомент(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	КоличествоНаборовКотороеМожноСобратьНаТекущийМоментНаСервере(ТабДок);
	
	ТабДок.ОтображатьСетку 	= Ложь;
	ТабДок.Защита 			= Ложь;
	ТабДок.ТолькоПросмотр 	= Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("производство Наборов ")+ объект.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура КоличествоНаборовКотороеМожноСобратьНаТекущийМоментНаСервере(ТабДок)
	
	Макет 	= Справочники.Номенклатура.ПолучитьМакет("МакетНабора");
	Дата 	= ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	
	ТаблСпецификация = новый ТаблицаЗначений;
	ТаблСпецификация.Колонки.Добавить("Номенклатура");
	ТаблСпецификация.Колонки.Добавить("Количество");
	
	добавитьвмассивспецификаций(объект.Состав, ТаблСпецификация, 1);	
	
	ТаблСпецификация.Свернуть("Номенклатура", "Количество");
	ТаблСпецификация.Колонки.Добавить("Цена");
	ТаблСпецификация.Колонки.Добавить("Остаток");
	МинимальныйДелегат  = -1;
	
	для каждого строкаспецификации из ТаблСпецификация Цикл
		если не ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(строкаспецификации.номенклатура) тогда
			строкаспецификации.цена = ОбщийМодульСервер.ПолучитьЦенуСписания(строкаспецификации.номенклатура, строкаспецификации.количество, Дата);
			строкаспецификации.остаток = ОбщийМодульСервер.ПолучитьОстатокТовара(строкаспецификации.номенклатура, , Дата);
			
			МожноПроизвести = цел(строкаспецификации.остаток / строкаспецификации.количество);
			Если МинимальныйДелегат  = -1
				или МожноПроизвести < МинимальныйДелегат  Тогда
				
				МинимальныйДелегат = МожноПроизвести;
			КонецЕсли;	
		иначе
			строкаспецификации.цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(строкаспецификации.номенклатура, , Дата, Истина, , , , , Объект.Ссылка);
			строкаспецификации.остаток = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТаблСпецификация.Колонки.Добавить("Использовано");
	ТаблСпецификация.Колонки.Добавить("НаСумму");
	
	для каждого строкаспецификации из ТаблСпецификация Цикл
		строкаспецификации.Использовано = МинимальныйДелегат * строкаспецификации.Количество;
		строкаспецификации.НаСумму 		= строкаспецификации.Использовано * строкаспецификации.цена;
	КонецЦикла;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	
	ОбластьЗаголовок.Параметры.дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	ОбластьЗаголовок.Параметры.Номенклатура = ?(ЗначениеЗаполнено(Объект.НаименованиеДляПечати), Объект.НаименованиеДляПечати, объект.Наименование);
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	для каждого строкаспецификации из ТаблСпецификация Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(строкаспецификации);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ОбластьПодвал.параметры.ИтогоНаборов = МинимальныйДелегат;
	НаСумму = ТаблСпецификация.Итог("НаСумму");
	ОбластьПодвал.параметры.НаСумму = НаСумму;
	
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда
		цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(объект.Ссылка, ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию"), дата, истина, МинимальныйДелегат, , , , Объект.Ссылка) ;
	Иначе
		цена = объект.Цена;
	КонецЕсли;
	
	ОбластьПодвал.параметры.цена 			= цена;
	ОбластьПодвал.параметры.НаборНаСумму 	= цена * МинимальныйДелегат;
	ОбластьПодвал.параметры.Выручка 		= (цена * МинимальныйДелегат) - НаСумму;
	
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры

&НаСервере
Процедура добавитьвмассивспецификаций(состав, ТаблСпецификация, Кво)
	
	для каждого строкасоставанабора из состав цикл
		
		Если строкасоставанабора.номенклатура.этонабор  = ИСТИНА Тогда
			добавитьвмассивспецификаций(строкасоставанабора.номенклатура.состав, ТаблСпецификация, строкасоставанабора.количество * Кво);	
			
		иначе
			СтрокаСпециф = ТаблСпецификация.добавить();
			СтрокаСпециф.Номенклатура 	= строкасоставанабора.номенклатура;
			СтрокаСпециф.количество 	= строкасоставанабора.количество * кво;
			
			Если СтрокаСпециф.количество = 0 Тогда
				СтрокаСпециф.количество = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //добавитьвмассивспецификаций

&НаКлиенте
Процедура РекомендуемыйМинимальныйОстатокТовараПриИзменении(Элемент)
	обновитьвидимостьуслуги();
КонецПроцедуры

&НаКлиенте
Процедура НеОтслеживатьОстатокПриИзменении(Элемент)
	обновитьвидимостьуслуги();
КонецПроцедуры

процедура обновитьвидимостьуслуги()
	
	элементы.РекомендуемыйМинимальныйОстатокТовара.Видимость = не УслугаНЕТовар и ВключитьВозможностьУказыватьРекомендованныйМинимальныйОстатокНоменклатуры и не объект.НеОтслеживатьОстаток ;
	элементы.НеОтслеживатьОстаток.Видимость 	= НоменклатураНеИспользовалась И не УслугаНЕТовар и объект.РекомендуемыйМинимальныйОстатокТовара = 0;
	элементы.Артикул.Видимость 					= не УслугаНЕТовар;
	элементы.Производитель.Видимость 			= не УслугаНЕТовар;
	Элементы.ГруппаСерийногоУчета.Видимость		= НоменклатураНеИспользовалась И НЕ УслугаНЕТовар И НЕ Объект.НеОтслеживатьОстаток;
	
	Если (УслугаНЕТовар ИЛИ Объект.НеОтслеживатьОстаток)
		и объект.СерийныйУчет Тогда
		
		объект.СерийныйУчет = Ложь;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	РодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РодительПриИзмененииНаСервере()
	
	элементы.ПланкаКоличестваДляЛьготнойЦены.Доступность 		= Истина;
	элементы.РекомендуемыйМинимальныйОстатокТовара.Доступность 	= Истина;
	Элементы.ОстатокНеОтслеживается.Видимость	= Объект.НеОтслеживатьОстаток И НЕ НоменклатураНеИспользовалась;
	элементы.НеОтслеживатьОстаток.Видимость 	= НоменклатураНеИспользовалась;
	элементы.СериныйУчет.Видимость 				= УчетПоСериям И Объект.СерийныйУчет И НЕ НоменклатураНеИспользовалась;
	Элементы.ГруппаСерийногоУчета.Видимость 	= НоменклатураНеИспользовалась;
	
	Родитель = Объект.Родитель;
	Если ЗначениеЗаполнено(Родитель) тогда
		
		Если НЕ родитель.КоличествоПоУмолчанию = 0 Тогда
			элементы.КоличествоПоУмолчанию.Доступность = Ложь;
			Если Не объект.КоличествоПоУмолчанию = родитель.КоличествоПоУмолчанию Тогда
				
				объект.КоличествоПоУмолчанию = родитель.КоличествоПоУмолчанию = ИстинА;	
			КонецЕсли;
		КонецЕсли;
		
		Если УчетПоСериям
			И Родитель.СерийныйУчет Тогда
			
			если НоменклатураНеИспользовалась 
				И не Объект.СерийныйУчет тогда				
				
				Объект.СерийныйУчет = Истина;    	
			КонецЕсли;
			
			Если Объект.СерийныйУчет ТОгда
				элементы.СериныйУчет.Видимость 			= Истина;
				Элементы.ГруппаСерийногоУчета.Видимость = ЛОЖЬ;	
			КонецЕсли;
			
			Если Родитель.ЗапретитьУказаниеБезСерии Тогда
				
				если НоменклатураНеИспользовалась 
					И НЕ Объект.ЗапретитьУказаниеБезСерии тогда				
					
					Объект.ЗапретитьУказаниеБезСерии = Истина;		
				КонецЕсли;			
				
				Если Объект.ЗапретитьУказаниеБезСерии Тогда
					Элементы.ЗапретитьУказаниеБезСерии.ТолькоПросмотр = Истина;
					элементы.СериныйУчет.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обязательно сопровождается серией");					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		если Родитель.НеОтслеживатьОстаток Тогда
			
			если НоменклатураНеИспользовалась
				И не Объект.НеОтслеживатьОстаток тогда
				
				Объект.НеОтслеживатьОстаток = истина;				
			КонецЕсли;
			
			Если Объект.НеОтслеживатьОстаток Тогда
				Элементы.ОстатокНеОтслеживается.Видимость	= Истина;
				элементы.НеОтслеживатьОстаток.Видимость 	= Ложь;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если не Родитель.ПланкаКоличестваДляЛьготнойЦены = 0 Тогда
			элементы.ПланкаКоличестваДляЛьготнойЦены.ТолькоПросмотр = Истина;
			
			если не объект.ПланкаКоличестваДляЛьготнойЦены = Родитель.ПланкаКоличестваДляЛьготнойЦены тогда
				объект.ПланкаКоличестваДляЛьготнойЦены = Родитель.ПланкаКоличестваДляЛьготнойЦены;
			КонецЕсли;
			
		КонецЕсли;
		
		Если не Родитель.РекомендуемыйМинимальныйОстатокТовара = 0 Тогда
			элементы.РекомендуемыйМинимальныйОстатокТовара.ТолькоПросмотр = Истина;
			
			если не объект.РекомендуемыйМинимальныйОстатокТовара = Родитель.РекомендуемыйМинимальныйОстатокТовара тогда
				объект.РекомендуемыйМинимальныйОстатокТовара = Родитель.РекомендуемыйМинимальныйОстатокТовара;	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ВидимостьСоставаНабора();
	
	если ПоддержкаДругихЯзыков тогда
		если НаименованиеИзменяли тогда
			ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, ПредставлениеНаименования);
			ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, НаименованиеДляПечати, "НаименованиеДляПечати");
		КонецЕсли;
		
		Если БылиИзмененияЗначенияПолейНаЯзыках Тогда
			Для Каждого СтрокаЯзыка Из НаименованияНаДругихЯзыках Цикл
				ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, СтрокаЯзыка.НаЯзыке, "Наименование", СтрокаЯзыка.Язык);	
			КонецЦикла;
			Для Каждого СтрокаЯзыка Из НаименованияДляПечатиНаДругихЯзыках Цикл
				ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, СтрокаЯзыка.НаЯзыке, "НаименованиеДляПечати", СтрокаЯзыка.Язык);	
			КонецЦикла;
		КонецЕсли;
	
	конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварИлиУслугаПриИзменении(Элемент)
	
	объект.НеОтслеживатьОстаток = УслугаНЕТовар;
	Если УслугаНЕТовар Тогда
		объект.ПланкаКоличестваДляЛьготнойЦены = 0;
	КонецЕсли;
	
	обновитьвидимостьуслуги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	если не ЗначениеЗаполнено(Объект.Наименование)
		и ЗначениеЗаполнено(Объект.НаименованиеДляПечати) Тогда
		
		Объект.Наименование = Объект.НаименованиеДляПечати;
	КонецЕсли;
	
	глПроверятьСообщения = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойШтрихКодОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	если не Объект.ОсновнойШтрихКод = "" тогда
		ЗапуститьПриложение("http://www.google.com.ua/search?q=" + Объект.ОсновнойШтрихКод);
	конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	если не Объект.Артикул = "" тогда
		ЗапуститьПриложение("http://www.google.com.ua/search?q=" + Объект.Артикул + Элемент.имя);
	конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерийныйУчетПриИзменении(Элемент)
	СерийныйУчетПриИзмененииК();
КонецПроцедуры

&НаКлиенте
Процедура СерийныйУчетПриИзмененииК()
	
	Элементы.ЗапретитьУказаниеБезСерии.Видимость = НоменклатураНеИспользовалась И УчетПоСериям И Объект.СерийныйУчет;
	Элементы.НеОтслеживатьОстаток.Видимость 	 = НоменклатураНеИспользовалась И НЕ Объект.СерийныйУчет;
	Элементы.КоличествоПоУмолчанию.Видимость     = не объект.СерийныйУчет И РегулироватьКоличествоНоменклатурыПоУмолчаниюДляУпаковок;
	
	Если Объект.СерийныйУчет
		и Объект.НеОтслеживатьОстаток Тогда
		
		Объект.НеОтслеживатьОстаток = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СерийныйУчетПриИзмененииК();
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	объект.Наименование  = ПредставлениеНаименования;
	НаименованиеИзменяли = Истина;
	
	если СоздаватьГруппыНоменклатурыПоПервомуСловуНаименованияИАвтоматическиОтноситьКНимНоменклатуру тогда
		НаименованиеПриИзмененииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	
	ГруппаПоПервомуСлову = ОбщийМодульТоварСервер.НаименованиеГруппыПоПервомуСлову(Объект.Наименование, Истина);
	Если не ГруппаПоПервомуСлову = Неопределено
		и не ГруппаПоПервомуСлову = Объект.Родитель Тогда
			
		Объект.Родитель = ГруппаПоПервомуСлову;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаДругихЯзыках(Команда)
	элементы.НаименованияНаДругихЯзыках.Видимость = НЕ элементы.НаименованияНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляПечатиНаДругихЯзыках(Команда)
	Элементы.НаименованиеДляПечатиНаДругихЯзыках.Видимость = НЕ Элементы.НаименованиеДляПечатиНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыках1НаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыках1ПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахНаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляПечатиПриИзменении(Элемент)
	
	объект.НаименованиеДляПечати = НаименованиеДляПечати;
	НаименованиеИзменяли = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИзображения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
		Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", Объект.Ссылка);
		ОткрытьФорму("Справочник.Изображения.ФормаСписка", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если НЕ ЗначениеЗаполнено(объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Записать();			
	КонецЕсли;
		
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", объект.Ссылка);
		формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);	
		формаИзображения.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		Если НЕ Отказ Тогда
	   Отказ = ПроверитьНаОтказ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьНаОтказ()
	
	отказ = ложь;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	ДокументОбъект.ПодготовкаКПроведению(Отказ);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура СоставНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = элементы.Состав.ТекущиеДанные;
	если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(ТекущиеДанные.Номенклатура);	
	КонецЕсли;
	
КонецПроцедуры
